---
kind: other
id: Methods.T:Autodesk.Revit.DB.Revision
source: html/a4226507-2398-be24-8e08-014353073d6d.htm
---
# Revision Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.